### SQL Query in PySpark

Lets create Json data first.
Create a file with extension "i am using emp.json"
Copy below data in file

{"name":"Deepak"}
{"name":"Amit"}
{"name":"Rudra", "age":20}
{"name":"Parul", "age":21}
{"name":"Sikha", "age": 20,"salary":200}

In [2]:
# Create connection
import pyspark
from pyspark.sql  import SparkSession
spark = SparkSession.builder.appName('Algae').getOrCreate()
print(spark)

<pyspark.sql.session.SparkSession object at 0x00000203D8315668>

In [3]:
df = spark.read.json('emp.json')
df.show()

+----+------+------+
| age|  name|salary|
+----+------+------+
|null|Deepak|  null|
|null|  Amit|  null|
|  20| Rudra|  null|
|  21| Parul|  null|
|  20| Sikha|   200|
+----+------+------+

### Register SQL View

In [4]:
# Register the DataFrame as a SQL temporary view
df.createOrReplaceTempView("emp")

In [5]:
sql_results = spark.sql("SELECT * FROM emp")

In [5]:
sql_results

DataFrame[age: bigint, name: string, salary: bigint]

In [10]:
sql_results.show()

+----+------+------+
| age|  name|salary|
+----+------+------+
|null|Deepak|  null|
|null|  Amit|  null|
|  20| Rudra|  null|
|  21| Parul|  null|
|  20| Sikha|   200|
+----+------+------+

In [13]:
sql_results.groupBy("name").mean().show()

+------+--------+-----------+
|  name|avg(age)|avg(salary)|
+------+--------+-----------+
| Rudra|    20.0|       null|
| Sikha|    20.0|      200.0|
|Deepak|    null|       null|
|  Amit|    null|       null|
| Parul|    21.0|       null|
+------+--------+-----------+

## SQL queries on PYSQL View

In [8]:
spark.sql("SELECT * FROM emp WHERE age=21").show()

+---+-----+------+
|age| name|salary|
+---+-----+------+
| 21|Parul|  null|
+---+-----+------+

In [9]:
spark.sql("SELECT * FROM emp WHERE age=21 or salary =200").show()

+---+-----+------+
|age| name|salary|
+---+-----+------+
| 21|Parul|  null|
| 20|Sikha|   200|
+---+-----+------+

In [7]:
sql_results = spark.sql("SELECT age, avg(salary) FROM emp  group by age")
sql_results.show()

+----+-----------+
| age|avg(salary)|
+----+-----------+
|null|       null|
|  21|       null|
|  20|      200.0|
+----+-----------+